app/controllers/post_controller.rb

SELECT  "things".* FROM "things" WHERE "things"."name" = ? LIMIT 1  [["name", "category"]]
SELECT  "dataas".* FROM "dataas" WHERE "dataas"."thing_id" = ? AND "dataas"."parent_id" = ? LIMIT 1  [["thing_id", 10], ["parent_id", 33]]
---
	def show
		@id 			= params[:id].to_i
		@dat 			= Thing.find_by!(name: "post_url").dataas.find_by!(id: @id)
		@thing_img 		= Thing.find_by!(name: "post_img")
		@thing_title 	= Thing.find_by!(name: "post_title")

		@resp = {
			:id => @dat.id,
			:title => @thing_title.dataas.find_by!(parent_id: @dat.id).value,
			:img => @thing_img.dataas.find_by!(parent_id: @dat.id).value